In [1]:
import pandas as pd

In [36]:
main = pd.read_excel('main.xlsx',usecols=['name'])
main

                                             name
0                                 RANJAN SENGUPTA
1                                   LAKSHYA THAPA
2                                 ARINDAM CHALIHA
3                                 GYANDEEP SARMAH
4                                  SASHANK SHARMA
..                                            ...
64                                  MOHIT PRADHAN
65                                  SAMRAT HALDAR
66  ADITYA KUMAR (RJ: CS1537 (EL) (ADV. WEB TECH)
67                SHANTAM GURUNG  (RJ: CS1566-SE)
68         SAKSHAM GUPTA (MA1502, CS1567- SL Lab)

[69 rows x 1 columns]

In [37]:
main.drop([66,67],axis=0,inplace=True)
main

                                      name
0                          RANJAN SENGUPTA
1                            LAKSHYA THAPA
2                          ARINDAM CHALIHA
3                          GYANDEEP SARMAH
4                           SASHANK SHARMA
..                                     ...
62                         SWARNIM PAUDYAL
63                           HISSEY BHUTIA
64                           MOHIT PRADHAN
65                           SAMRAT HALDAR
68  SAKSHAM GUPTA (MA1502, CS1567- SL Lab)

[67 rows x 1 columns]

In [38]:
main.replace('SAKSHAM GUPTA (MA1502, CS1567- SL Lab)','SAKSHAM GUPTA',inplace=True)

In [39]:
main

               name
0   RANJAN SENGUPTA
1     LAKSHYA THAPA
2   ARINDAM CHALIHA
3   GYANDEEP SARMAH
4    SASHANK SHARMA
..              ...
62  SWARNIM PAUDYAL
63    HISSEY BHUTIA
64    MOHIT PRADHAN
65    SAMRAT HALDAR
68    SAKSHAM GUPTA

[67 rows x 1 columns]

In [71]:
cur = pd.read_excel('cur.xlsx',usecols=['name'])
df = pd.concat([main,cur],ignore_index=True)
gr = df.groupby('name')
index = [x[0] for x in gr.groups.values() if len(x) == 1]
df.reindex(index)

                           name
9               DEBASHISH GOGOI
16           HARISH CHANDRA DAS
83            HARISHCHANDRA DAS
72                 HARSHVARDHAN
42         HARSHVARDHAN AGARWAL
65                SAMRAT HALDAR
71                SAMRAT HALDER
105          SHREYANSH A SHUKLA
26   SHREYANSH ALOKKUMAR SHUKLA
62              SWARNIM PAUDYAL

In [73]:
d = {'ab':[1,2],'abc':[2]}
for x in d.values():
    print(x[0])

1
2